Repository: YellowRoka/webCV
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Name:
hu: Név:

source: Birth:
hu: Születési idő:

source: Mobile:
hu: Mobil:

source: Address:
hu: Cím:

source: Company:
hu: Cég:

source: Position:
hu: Pozíció:

source: Date:
hu: Dátum:

source: Place:
hu: Hely:

source: Tasks:
hu: Feladatok:

source: Experiences:
hu: Tapsztalatok:

# progLang
source: Programming languages:
hu: Programozási nyelvek:

source: University:
hu: Egyetem:

# generalSubs
source: General Subjects:
hu: Álltalános Tárgyak:

# vocationalSubs
source: Vocational Subjects:
hu: Specializációs Tárgyak:

source: Thesis:
hu: Diploma munka:

source: Brief:
hu: Leírás:

source: Langauges:
hu: Nyelvek:

source: Trainings:
hu: Képzések:

# genPdf
source: Generate PDF...
hu: PDF készítése...

# plsPatient
source: Please be patient! It need ~10-30 seconds to load.
hu: Kérlek légy türelmes! ~10-30 másodperc míg elkészül.

# savePage
source: Save my page:
hu: Ments el az oldalt:

source: Got it!
hu: Kész!

# changedToLV
source: Changed to list view
hu: Váltás lista nézetre

# winIsSmall
source: Window size is too small for larger view!
hu: Túl kicsi az ablak mérete a nagyobb nézethez!

# hintChangeLG
source: Change to Grid / List view
hu: Nézet váltás

# hintOpenNav
source: Open navigation
hu: Navigáció kinyitása

# hintSendMail
source: Send me an email if you want an offer from me :)
hu: Küldj egy mailt ha szeretnél kérni egy ajánlatot :)

# hintCreatePDF
source: Create PDF from my CV
hu: PDF készítése a webCV-ből

# hintGetConntects
source: Get my conntects
hu: Konntaktok mentése

# hintOCMenu
source: Open / Close menu
hu: Menu be/ki-nyitása

# hintBackToMain
source: Back To Main page
hu: Vissza a főoldalra

source: References
hu: Referenciák

# cruzrForMZX
source: CruzR App For MZX
hu: CruzR Applikáció az MZX-nek

# diverzumTestJob
source: Diverzum Test App
hu: Diverzum Teszt Feladat

# ffnextTestJob
source: ff.Next Test App
hu: ff.Next Teszt Feladat

source: References videos
hu: Referencia videók

# ote
source: Help App for Ã–TE
hu: Segéd Applikáció ÖTE-nek

# czurPlanet
source: CruzR App on Planet 2021
hu: CruzR Applikáció a 2021 Planet kiállításon

# cruzrMVM
source: CruzR App on 52.th MVM Conferenc
hu: CruzR Applikáció az 52. MVM Conferencián

# webLinks
source: Links:
hu: Linkek:

# mediaLinks
source: Media:
hu: Médiák:

# gitLinks
source: Git Projects:
hu: Git Projektek:

# hintGoToRef
source: Go to References
hu: Tovább a Referenciákhoz

# profilDetails
source: I am a software and system developer with a good knowledge of embedded systems. I am constantly improving my skills with self-training and dedicated courses. I moved from the embedded system to mobile (android), web, desktop and unique development based on Flutter. When I make Flutter projects then I most often use:
hu: Szoftver- és rendszerfejlesztő vagyok, aki jól ismeri a beágyazott rendszereket. Folyamatosan fejlesztem képességeimet önképzéssel és dedikált tanfolyamokkal. Nemrég váltottam a beágyazott rendszerről a Flutter-re épülő mobil (android), web és asztali fejlesztésre. Flutter projektek esetén, leggyakrabban a következőket használom: -BloC, -Hive, -OOP, -külső csomagok, -CleanCode, -JSON, -explicit és implicit animációk, -REST-API-k, -Blender, -Git verzió kezelő, -Agilis vagy DSDM fejlesztői módszertan.
